<?php

return [
    'invalid_credentials' => 'محاولة غير صالحة لتسجيل الدخول',
    'user_disable' => 'هذا المستخدم معطل',
    'invalid_otp' => 'رقم التحقق خاطئ',
    'otp_int' => 'رقم التحقق يجب ان يكون رقما ',
    'otp_required' => 'هذا الحقل اجباري ',
    'phone_required' => 'هذا الحقل اجباري ',
    'employee_number_exists' => 'رقم الموظف غير مسجل لدينا بالنظام ',
    'password_required' => 'هذا الحقل اجباري ',
    'user_blocked' => 'تم تعطيل المستخدم حاليا يمكنكم الرجوع الى الدعم الفني لاستعادة كلمة المرور. ',
    'phone_not_found' => 'هذا الرقم غير مسجل بالنظام',
    'password_regex' => 'كلمة المرور يجب يجب ان لا تقل عن 8 حروف و ان تحتوي على حروف كبيرة وصغيرة وارقام وعلامات خاصة'
];
