<?php

return [
    'permissions' => [
        'required_name' => 'رجاء إدخال اسم الصلاحية',
        'unique_name' => 'عفوا اسم الصلاحية موجود مسبقا',
        'required_slug' => 'رجاء إدخال اسم الصلاحية',
        'unique_slug' => 'عفوا اسم الصلاحية موجود مسبقا',
    ],
    'roles' => [
        'required_name' => 'رجاء إدخال اسم المجموعة',
        'unique_name' => 'عفوا اسم المجموعة موجود مسبقا',
        'required_slug' => 'رجاء إدخال اسم المجموعة',
        'unique_slug' => 'عفوا اسم المجموعة موجود مسبقا',
        'required_permissions' => 'عفوا يجب ادخال صلاحيات الي المجموعة',
    ],
    'image' => [
       'mimes' => ' الأمتدادات المتاحة هى jpeg,png,jpg',
        'max' => 'حجم الصورة لا يزيد عن 3MB',
       'image' => 'الملف يجب أن يكون صورة'
    ],
    'employee_id' => [
        'required' => 'رقم الموظف يجب إدخاله',
        'exists' => 'الموظف لا يجب أن يكون موجود مسبقاً',
        'unique' => 'رقم الموظف لا يجب أن يكون موجود مسبقاً'
    ],
    'employee_number' => [
        'required' => 'رقم الموظف يجب إدخاله',
        'digits' => 'رقم الوموظف يجب يكون 6 أرقام'
    ],
    'password' => [
        'required' => 'لرقم السرى يجب إدخاله',
        'digits_between' => 'الرقم السرى يجب يكون من 6 ل 10 أرقام'
    ],
    'is_send_otp' => [
        'required' => 'حالة كود التحقق يجب إدخالها',
    ]
];
