<?php

return [
    'nationality'=>[
        'name'=>[
            'required'=>'.حقل اسم الجنسية مطلوب',
            'array' => '.يحب ان يحتوي حقل اسم الجنسية علي عنصر او اكثر',
            '*' => [
                'required' => '.حقل اسم الجنسية مطلوب',
                'string' => '.يحب ان يكون حقل اسم الجنسية نصًا'
            ]
        ]
    ],
    'management'=>[
        'name'=>[
            'required'=>'.حقل اسم الإدارة مطلوب',
            'unique'=>'إسم الإداره مستخدم من قبل ',
            'max' => 'إسم القسم لايزيد عن 100 حرف',
            'regex' => 'لا يمكن إضافه العلامات الخاصه',
            'string' => '.يحب ان يكون حقل اسم الإدارة نصًا',
            'delete' => 'لا يمكن أرشفه قسم مشغول ',
        ],
         'image'=>[
            'mimes_image' => 'الامتدادات المتاحة هي : (jpg,png,jpeg)',
            'image' => 'الرجاء رفع صور فقط ',
         ],
         'description'=>[
            'max' => 'وصف القسم لايزيد عن 500 حرف',
         ],
        'deactivate'  => 'لا يمكنك تعطيل ادارة مشغولة'

    ],
    'job' => [
        'name'=>[
        'requierd' => 'إسم الوظيفة مطلوب',
        'max' => 'إسم الوظيفة لايزيد عن 100 حرف',
        'regex' => 'لا يمكن إضافه العلامات الخاصه',
        'delete' => 'لا يمكن أرشفه وظيفة مشغولة ',
        ] ,
        'management'=>[
            'requierd' => 'إسم القسم مطلوب',
        ],
        'salary_types'=>[
            'in' => '  الرجاء اختيار نوع العقد بطريقه صحيحة',
        ]
    ],
    'vacationtype'=>[
        'name'=>[
            'required'=>'.حقل اسم نوع الاجازة مطلوب',
        ],
        'number_days'=>[
            'required'=>'.حقل عدد ايام نوع الاجازة مطلوب',
            'integer'=>'يجب ان يكون عدد ايام الاجازة رقم '
        ]
    ],
    'vacation'=>[
        'number_days'=>[
            'required'=>'.حقل عدد ايام نوع الاجازة مطلوب',
            'integer'=>'يجب ان يكون عدد ايام الاجازة رقم '
        ],
        'vacation_from_date'=>[
            'required'=>'.حقل بداية الاجازة مطلوب',
            'date'=>'يجب ان يكون عدد ايام الاجازة رقم '
        ],
    ],
    'resignation'=>[
        'management_id'=>[
            'required'=>'.حقل الادارة مطلوب',
        ],
        'employee_id'=>[
            'required'=>'.حقل الموظف مطلوب',
        ],
        'reason'=>[
            'required'=>'يجب إدخال سبب واحد على الاقل',
        ],
    ],
    'service' => [
        'management' => [
            'required' => 'حقل الإدارة مطلوب',
            'exists' => 'الإدارة يجب تكون موجوده فى الإدارات'
        ],
        'employee' => [
            'required' => 'حقل الموظف مطلوب',
            'exists' => 'الموظف يجب تكون موجوده فى الموظفين'
        ],
        'service_type' => [
            'required' => 'حقل نوع الخدمة مطلوب',
        ],
        'directed_to' => [
            'required' => 'حقل الجهة مطلوب',
        ],
        'notes' => [
            'required' => 'حقل الملاحظات مطلوب',
        ],
        'attachments' => [
            'array' => 'array حقل المرفقات يجب يكون ',
        ]
        ],
        'attendes' => [
            'employee' => [
                'required' => 'حقل الموظف مطلوب',
            ],
            'attended_at' => [
                'required' => 'حقل موعد الحضور مطلوب',
            ],
            'method' => [
                'required' => 'حقل نوع الحضور مطلوب',
            ],
            'branch' => [
                'required' => 'حقل نوع الشركة مطلوب',
            ],
            'leaved_at' => [
                'required' => 'حقل موعد المغادرة مطلوب',
            ],
            'date' => [
                'required' => 'حقل التاريخ مطلوب',
                'date_format' => 'Y-m-d حقل التاريخ يجب يكتب هكذا '
            ]
        ]

];
