<?php

return [
    'reception_report' => [
        'title'=>[
        'requierd' => 'إسم البلاغ مطلوب',
        'max' => 'إسم البلاغ لايزيد عن 150 حرف',
        'regex' => 'لا يمكن إضافه العلامات الخاصه',
        ] ,
        'date'=>[
        'requierd' => 'تاريخ البلاغ مطلوب',
        'after_or_equal' => 'لا يمكن إضافه تاريخ سابق',
        ] ,
        'management_id'=>[
            'requierd' => 'إسم القسم مطلوب',
        ]
    ],

  'visit' => [
       'date' => [
        'required' => 'التاريخ مطلوب',
        'after_or_equal' => 'التاريخ يجب أن يكون أكبر من أو يساوى اليوم'
       ],
       'time' => 'الوقت مطلوب',
       'time_type' => 'نوع الوقت صباخاً أو مساءً مطلوب',
       'management_id' => 'رقم الإدارة مطلوب',
       'type' => [
        'requierd' => 'نوع الزيارة مطلوب',
        'max' => 'نوع الزيارة يجب أن لا يتعدى من 150 حرف'
       ],
       'status' => 'الحلة يجب ان تكون حالة من الآتى [new,underway,finished,canceled]',
       'visitors' => [
        'requierd' => 'يجب إدخال زائرين للزيارة',
        'name'=> 'حقل الإسم يجب إدخاله',
        'identity_number' => 'حقل الهوية يجب إدخاله',
        'visit_id' => 'يجب إدخال رقم الزيارة',
       ],
       'employees' => [
        'requierd' => 'يجب إدخال موظفين إستقبال للزيارة',
        'employee_id' => 'يجب تواجد رقم الموظف'
       ],
    ]
];
